Revit 2024 API
Field.FieldName Property
 The name of the field.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public string FieldName { get; }
Visual Basic
Public ReadOnly Property FieldName As String
	Get
Visual C++
public:
property String^ FieldName {
	String^ get ();
}
See Also
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace